{"chunk_id": "doc_0_c0", "doc_id": "doc_0", "text": "﻿\nBank of Maharashtra - Home Loan with Lowest Interest Rates\nMaha Super Housing Loan Scheme\nMaha Super Housing Loan Scheme\nEmbarking on the journey to homeownership is an exciting endeavour, and Bank of Maharashtra understands that every homeowner’s journey is special. Explore the diverse range of home loan products tailored to suit different needs, from first-time buyers to those looking to refinance or renovation. With customised home loan products, competitive interest rates and a commitment to transparency, Mahabank stands as a reliable partner in turning your homeownership dreams into reality. Choose Bank of Maharashtra and step confidently into a future filled with joy of owning your dream home! Interest Rate\n7.35\n%P.A*\nGet a Call Back\nApply Online\nMaha Super Housing Loan Types\n1. Maha Super Housing Loan Scheme for Construction/Acquiring\nKnow More...\n2.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c1", "doc_id": "doc_0", "text": "Maha Super Housing Loan Scheme for Construction/Acquiring\nKnow More...\n2. Maha Super Housing Loan Scheme for Purchase of Plot and Construction thereon\nKnow More...\n3. Maha Super Housing Loan Scheme for repairs/ renovation/alteration of existing house/flat\nKnow More... Features & Benefits\nDocuments Required\nInterest Rates\nEMI Calculator\nCheck Eligibility\nFAQs\nHow to Apply\nFeatures & Benefits\nFeatures and benefits of Home Loan\nLow EMI\nHigher Loan Amount\nTrack my Loan\nApproved Projects\nSimplified Disbursement\nNo Processing Fee\nNo Hidden Charges\nNo Prepayment Penalty\n0.05% concession to women and defence personal. Maximum Tenure up to 30 Years / up to 75 years of age. No Pre-Payment / Pre-closure / Part payment Charges.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c2", "doc_id": "doc_0", "text": "No Pre-Payment / Pre-closure / Part payment Charges. Concession in ROI for Housing Loan borrower in Car Loan & Education Loan. Bank of Maharashtra Offers Lowest Interest Rate on Home Loan in India\nDocuments Required\nDocuments required for Home Loan\nApplication form duly complete and signed. Two Passport Size Photographs. Proof of Identification : (any one)\nElection ID Card\nPan Card\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nProof of Residence : (any one)\nElectricity Bill\nElection ID Card\nTelephone Bill (Landline)\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nFor Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c3", "doc_id": "doc_0", "text": "Undertaking from employer for remittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\nFor Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc. Shop Establishment Act\nTax Registration Copy\nCompany Registration License\nBank statement for past one year\nGuarantor forms along with net worth proof /income proof (if applicable)\nGuarantor’s IT return along with KYC documents as mentioned in point 3 & 4\nIn case of Takeover(Refinance):\nLoan Outstanding statement as on date\nLoan account statement for last 12 months\nDocuments Acknowledgement Receipt from Bank\nProperty Documents:\nReceipts for payments made for purchase of the residential unit\nCopy of approved drawings of proposed construction/purchase\nPermission from competent authority for construction of flat/house\nPermission from competent authority under Urban Land ceiling & Regulation Act 1976\nAgreement of Sale/Sale Deed/Detailed cost estimate from Regd.Architect/Engineer for the property to be constructed. Allotment letter from the Builder/Co-operative Society/Development Authorities/Association of apartment owners etc. Other documents depending upon:\nProperty to be purchased directly from Builder (Ready/Under-construction)\nProperty belonging to a Registered Co-operative Housing Society\nPurchase in resale. Direct sale by any Development authority\nConstruction of house on separate plot of land.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c4", "doc_id": "doc_0", "text": "Direct sale by any Development authority\nConstruction of house on separate plot of land. Additional Documents for NRIs\nCopy of employment Contract (if the contract is in any language other than English, the same has to be translated into English and attested by Employer /Indian Embassy)\nCopy of Identity Card issued by the current Employer\nContinuous Discharge certificate, if applicable\nCopy of latest work permit\nCopy of Visa stamped on the passport\nNRE Bank account passbook or statement of account\nOverseas Bank account statements for last 6 months in which salary is credited\nA Salary certificate/income statement duly attested by out foreign office including subsidiary office/certified by the competent authority available in the country may be produced. This may also include Chartered /Certified Accountants, Officials of Inland Revenue dept. (similar to Income Tax Authorities in India) or any other agency specified for the purpose. Where ever attestation is not possible, this may be submitted duly notarized. Additional Documents for PIOs\nA photocopy of PIO card or any of the under noted documents:-\nCurrent Passport indicating birth place of India/Abroad\nIndian Passport, if held earlier\nParents or grandparents passport with details there in substantiating his claim of being PIO.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c5", "doc_id": "doc_0", "text": "Additional Documents for PIOs\nA photocopy of PIO card or any of the under noted documents:-\nCurrent Passport indicating birth place of India/Abroad\nIndian Passport, if held earlier\nParents or grandparents passport with details there in substantiating his claim of being PIO. Interest Rates\nHome Loan Interest Rates\nBank of Maharashtra helps you buy your dream home with low EMIs. The\nEMI Calculator\non the website works this out for you. Check your eligibility, upload your documents and obtain instant in-principle sanction. Housing Loan Interest Rate\n7.35\n%P.A*\nFore more Interest Rates & Charges\nClick here\nEMI Calculator\nHome Loan EMI Calculator\nPrincipal Loan Amount\n*\n:\nInterest Rate ( % p.a )\n*\n:\nLoan Term (Years)\n*\n:\nSHOW EMI\nCheck Eligibility\nHome Loan Eligibility\nHow will Bank of Maharashtra decide the home loan amount i am eligible for? Maximum loan amount will be lowest of loan amount assessed on the basis of Permissible Deduction norms, Maximum permissible LTV ratio, Loan amount requested.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c6", "doc_id": "doc_0", "text": "Maximum loan amount will be lowest of loan amount assessed on the basis of Permissible Deduction norms, Maximum permissible LTV ratio, Loan amount requested. FAQs\nFrequently Asked Questions (FAQs)\nWhat is a Home loan and how does it work? Home loans are availed for\nConstruction/acquiring of new or existing house/flat and extension of existing house/flat. Home loan to purchase new flat\nHome extension loan\nPurchase of plot and construction there on. For Repairs /renovation/alternation of existing house/flat for new standalone borrowers. A Bank of Maharashtra home loan provides numerous benefits such as facility to apply online, quick loan processing, attractive interest rates, customized repayment options and simple & hassle-free documentation.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c7", "doc_id": "doc_0", "text": "A Bank of Maharashtra home loan provides numerous benefits such as facility to apply online, quick loan processing, attractive interest rates, customized repayment options and simple & hassle-free documentation. What are the features of Home loan? The features of Maha Super Housing Loan are as below:\n0.05% concession to women and defence personal. Maximum tenure up to 30 years/up to 75 years of age. No Pre-payment/Pre-closure/Part payment charges. Concession in ROI for Housing Loan borrower in Car Loan and Education loan.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c8", "doc_id": "doc_0", "text": "Concession in ROI for Housing Loan borrower in Car Loan and Education loan. Bank of Maharashtra Offers Lowest Interest Rate on Home Loan in India\nHow will Bank of Maharashtra decide the home loan amount i am eligible for? Maximum loan amount will be lowest of loan amount assessed on the basis of Permissible Deduction norms, Maximum permissible LTV ratio, Loan amount requested. When does my home loan EMIs start? EMI's begins from the month subsequent to the month in which disbursement of the loan is done. For loans for under-construction properties EMI usually begins after the complete home loan is disbursed but customers can choose to begin their emi’s as soon as they avail their first disbursement and their emi’s will increase proportionately with every subsequent disbursement.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c9", "doc_id": "doc_0", "text": "For loans for under-construction properties EMI usually begins after the complete home loan is disbursed but customers can choose to begin their emi’s as soon as they avail their first disbursement and their emi’s will increase proportionately with every subsequent disbursement. For resale cases, since the whole loan amount is disbursed in one go, emi on the whole loan amount start from the subsequent to the month of disbursement\nCan home loan be transferred from one bank to another? Yes, it is possible to transfer a home loan in India, from one Bank to another under certain circumstances. Home loan transfer typically refers to the process of transferring an existing home loan from one bank or financial institution to another. This is done to take advantage of better interest rates, lower fees or improved loan terms offered by the new lender\nWhat is floating interest rate? A floating interest rate sometimes known as variable interest rate, is an interest rate that varies over time according to changes in a reference rate or index.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c10", "doc_id": "doc_0", "text": "A floating interest rate sometimes known as variable interest rate, is an interest rate that varies over time according to changes in a reference rate or index. It's often used in financial products like mortgages, home loans and other investments. What is the EMI for 50 lakhs home loan? For calculating the EMI (Equated Monthly Installment) for a home loan in India, we must also consider the loan amount, interest rate and loan period. To get accurate EMI estimate, visit the website of Bank of Maharashtra & calculate the precise EMI cost using home loan EMI calculator. The approximate EMI for a 50 lakhs home loan with an interest rate of 7.35% per annum and 15 year tenure would be around ₹45925\nWhat are the different type of home loan available?", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c11", "doc_id": "doc_0", "text": "The approximate EMI for a 50 lakhs home loan with an interest rate of 7.35% per annum and 15 year tenure would be around ₹45925\nWhat are the different type of home loan available? Depending upon the needs and requirements of customers, there are different types of home loans available in India. Some of the popular types of home loans includes,\nPlot Purchase & Construction thereon Loans\nHome/Flat Purchase Loans\nLoans for repair/renovation of existing homes\nHome Extension Loan\nNRI Home Loans\nBank of Maharashtra provides varieties of home loans under Maha Super Housing Loan Scheme. Which factor affect home loan eligibility? Some of the factors that affect home loan eligibility in India are:\nIncome\nCredit Score\nEmployment Stability\nAge\nExisting Debt Obligations\nDown Payment\nProperty Value and Location\nLoan Tenure\nCan home loan be taken jointly? Yes, it is possible to obtain a home loan in India jointlyalong with close relatives.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c12", "doc_id": "doc_0", "text": "Yes, it is possible to obtain a home loan in India jointlyalong with close relatives. Joint home loans are common which offer various benefits to customers. When two or more people apply for a home loan together, they are sharing the obligation as well as eligible for higher loan amount. How to get a home loan with ease? Obtaining a home loan in India is an important financial decision. While the procedure may require some documentation and effort, there are several steps you can do to improve your possibilities of getting approved for a home loan.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c13", "doc_id": "doc_0", "text": "While the procedure may require some documentation and effort, there are several steps you can do to improve your possibilities of getting approved for a home loan. Check if you're eligible\nMaintain good credit score\nChoose the right loan type\nOrganize your documents\nHow to check home loan eligibility? To check home loan eligibility in India, you need to consider the following criteria:\nConsider your income and financial stability\nDetermine your credit score\nFigure out your repayment ability\nMake use of online eligibility calculators\nWho can be a co-applicant? A co-applicant can be any person who shares the financial obligation and accountability of the loan with the primary applicant while applying for a home loan in India. The co-applicant will be considered as an equal borrower and equally accountable for loan repayment. It can be the primary applicant's spouse, parents, children, siblings or other close family relatives who have a stable source of income\nWhen does my loan repayment period begin?", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c14", "doc_id": "doc_0", "text": "It can be the primary applicant's spouse, parents, children, siblings or other close family relatives who have a stable source of income\nWhen does my loan repayment period begin? The repayment period for a home loan typically begins after the loan has been disbursed to you and/or the property purchasetransaction has been completed. This means that once you have received the funds and the ownership of the home has been transferred to you, your repayment obligations will start. The specific start date of your home loan repayment period should be outlined in the loan agreement you signed with the lender. It's important to review your loan agreement to understand the terms and conditions, including the repayment start date, repayment schedule, interest rate, and any other relevant details pertaining to your specific loan. For what purpose Can I take top up home loan ?", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c15", "doc_id": "doc_0", "text": "For what purpose Can I take top up home loan ? Top-Loan on your home loan can be availed for various purposes such as repairs and renovations and other expenses such as weddings, education etc. What is the interest rate of top up loan in BoM? ROI on Top -up loans for repair and renovation as well as for any other purpose will be 20bps higher than that applicable on the Maha Super Housing Loan Scheme (currently). What are the benefits of home top up loan ? The benefits of a Home Top-Up Loan include access to additional funds for various purposes such as repairs and renovation, marriage and other related expenses at lower interest rates compared to personal loans.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c16", "doc_id": "doc_0", "text": "The benefits of a Home Top-Up Loan include access to additional funds for various purposes such as repairs and renovation, marriage and other related expenses at lower interest rates compared to personal loans. Additionally, the repayment tenure on Top-Up loans is higher than that of personal loans. How many times we can get top up home loan? There is no limit on the number of times you can avail of a Top-up loan on your home loan depending on fulfilling other terms and conditions as per the Top-Up Loan. However, only one top-up loan can be active at any given point in time. What is eligibility for home loan in Bank of Maharashtra?", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c17", "doc_id": "doc_0", "text": "What is eligibility for home loan in Bank of Maharashtra? For Resident Indians: Individual salaried employees (with a permanent job for a period of minimum 1-year continuous service) of State/ Central Government/ Public/ Private Sector Companies of repute, Self-Employed Professionals, and Businessmen. Non-resident Indians (NRIs) holding Indian Passport, Persons of Indian Origin (PICOs), and Overseas Citizens of India (OCI) are treated as NRIs: Salaried applicants/ co-applicant/s (whose income can be considered for eligibility), should have a regular job abroad in a reputed Indian/ Foreign Company, Organization or Government Department having a valid job contract/work permit for the minimum past 2 years. How can we apply for home loan? To apply for a Home Loan, one can either visit the nearest branch and complete all the required formalities or apply online through Bank of Maharashtra's website: bankofmaharashtra.in\nHow much time does it take to sanction home loan? On average, loans are disbursed within 3-10 days after satisfactory completion of documentation and all the required procedures.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c18", "doc_id": "doc_0", "text": "On average, loans are disbursed within 3-10 days after satisfactory completion of documentation and all the required procedures. What is home loan interest rate at bank of maharashtra? Interest rates for Home Loans depend on a variety of factors such as Credit Score, amount of loan, profession etc. For more information on Interest rates on Home loans click on\nwww.bankofmaharashtra.in\nHow to get home loan for construction of house? To apply for a Home loan, you can apply online through our website (bankofmaharashtra.in ) or can visit the nearest branch and complete all the required formalities. what is the interest rate for home loan for womens?", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c19", "doc_id": "doc_0", "text": "what is the interest rate for home loan for womens? Yes, Home loan interest rates are lower for women than those applicable to others. The bank offers a 0.05% concession on home loans to women, subject to certain terms and conditions. How much percentage interest for BoM home loan for womens? Interest rates for Home Loans depend on variety of factors such as credit score, amount of loan, profession etc. Additionally, Bank of Maharashtra offers a 0.05% concession on interest for women borrowers.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c20", "doc_id": "doc_0", "text": "Additionally, Bank of Maharashtra offers a 0.05% concession on interest for women borrowers. What is bank of maharashtra home loan processing fee? The applicable processing fee is 0.25% of the loan amount plus applicable GST. Note: Processing Fees waiver for the period upto 31.12.2025\nwho can be co applicant for home loan? All co-owners of the property need to be co-applicants to the home loan. Generally, co-applicants are close family members.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c21", "doc_id": "doc_0", "text": "Generally, co-applicants are close family members. How does home loan tenure affect your interest rate? No, Home loan tenure doesn't affect your interest rates. Interest rates on Bank of Maharashtra home loans are calculated based on the credit score of the applicant/s. Is it compulsory to take home loan insurance? While not mandatory, the Bank strongly recommends considering Home Loan insurance.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c22", "doc_id": "doc_0", "text": "While not mandatory, the Bank strongly recommends considering Home Loan insurance. This insurance acts as a safety net, safeguarding your Home Loan in the event of unforeseen circumstances. Is there any prepayment or foreclosure charges in home loan? There are no Pre-Payment / Pre-Closure / Part-Payment Charges\nWhat is the maximum tenure on Bank of Maharashtra home laon? The maximum tenure for Bank of Maharashtra Home Loan is up to 30 years or until the borrower reaches the age of 75 years, whichever is earlier. How to Apply\nHow to Apply Home Loan\nScan this Code to see\nHow to Apply for Digital Loans Online\nFollow the step by step instructions to avail digital loan facility from our bank.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c23", "doc_id": "doc_0", "text": "How to Apply\nHow to Apply Home Loan\nScan this Code to see\nHow to Apply for Digital Loans Online\nFollow the step by step instructions to avail digital loan facility from our bank. Please click on the following link to view\nhow to apply for Digital Loan Online:\nHow to Apply for Digital Loans Online\nSimilar Products\nPurchase of New House/Flat\nBank of Maharashtra provide loan for purchase a new house or for purchase a flat. KNOW MORE\nHome Extension Loan\nIt is a loan to extend or add space to your home such as additional rooms and floors etc. KNOW MORE\nPlot Purchase Loan\nFor purchase of a plot through direct allotment or a second sale transaction as well...\nKNOW MORE\nHouse Renovation Loans\nIt is a loan for renovating your home in many ways such as tiling, flooring and painting etc. KNOW MORE\nInternet Banking\nInterest Rates\nHousing Loan\n7.35\n% P.A*\nApply Now! Car Loan\n7.70\n% P.A*\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c24", "doc_id": "doc_0", "text": "Car Loan\n7.70\n% P.A*\nApply Now! Gold Loan\n8.75\n% P.A*\nApply Now! Education Loan\n7.10\n% P.A*\nApply Now! Deposit Schemes\n7.15\n% P.A*\nKnow More\nApply Online\nHousing Loan\nApply Now! e-GST Loan\nApply Now! Car Loan\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c25", "doc_id": "doc_0", "text": "Car Loan\nApply Now! Gold Loan\nApply Now! Personal Loan\nApply Now! Online SB Account\nOpen Now! Downloads\nCalculators\nService Charges\nPublic Information\nGallery\nSocial Activity\nAssets for Sale\nTenders\nDisclosure\nBasel II Disclosure\nBasel III Disclosure\nBRSR Disclosures\nESG Disclosures\nCompliance\nRTI\nReplies to RTI Applications\nCEPD\nCitizen Charter\nABBFF Guidelines\nPIDPI\nComplaint Handling Mechanism\nIndependent External monitors (IEMs)\nEmployee Corner\nReservation Roster\nRetired Employee’s Corner\nLife Certificate Format for Staff Pensioner\nHRMS\nFinancial Inclusion / Pradhamantri Yojana\nPMJDY\nPMJDY FAQs\nImportant Links\nIs your Bank account KYC compliant? Bank's wilful Defaulters\nAssets in possession under SARFAESI Action\nState Wise Holiday\nRBI Kehta Hai\nSachet Portal\nCalendar 2025\nVerify CheckSum value\nBlogs\nFeedback\nGet In Touch\nBank of Maharashtra Head Office\nLokmangal, 1501, Shivajinagar\nPune-411005,\n020 - 25514501 to 25514505\nImportant\nBank of Maharashtra never ask for Bank account details for any purpose through phone call/email/SMS.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c26", "doc_id": "doc_0", "text": "Bank's wilful Defaulters\nAssets in possession under SARFAESI Action\nState Wise Holiday\nRBI Kehta Hai\nSachet Portal\nCalendar 2025\nVerify CheckSum value\nBlogs\nFeedback\nGet In Touch\nBank of Maharashtra Head Office\nLokmangal, 1501, Shivajinagar\nPune-411005,\n020 - 25514501 to 25514505\nImportant\nBank of Maharashtra never ask for Bank account details for any purpose through phone call/email/SMS. Bank appeals to all the customers not to respond to such phone call/email/SMS and not to share their bank account detail with any one for any purpose. Never share your CVV/ PIN No. of Debit/Credit card to anyone. Disclaimer\nPrivacy Policy\nCookies Policy\nSitemap\nClick here to view last visited page\nOur Services\nSCROLL TO TOP\nBank of Maharashtra, India's leading Public Sector Bank offers Deposits,Loans,Digital products for personal Banking, Corporates,MSMEs & NRI Customers\nBank of Maharashtra use cookies to enhance your experience on Bank’s website. Read More...\nBy using our website, you agree to place these cookies on your device.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_0_c27", "doc_id": "doc_0", "text": "Read More...\nBy using our website, you agree to place these cookies on your device. You can disable/delete these cookies by changing your web browser settings. Bank of Maharashtra is not responsible for cookies placed in the device of user/s by any other website and information collected thereto. Check out our\nCookie/Privacy Policy and Terms & Conditions. OK", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/home-loan", "fetched_at": "2025-11-12T11:55:23.174871Z"}
{"chunk_id": "doc_1_c0", "doc_id": "doc_1", "text": "﻿\nStudent Education Loan (Apply Online) - Bank of Maharashtra\nMahabank Education Loan\nMahabank Education Loan\nIn today’s competitive world where advancements and opportunities are ample, obtaining a higher education has become essential for career growth and success. We empower students by providing them with the financial support they need to pursue their desired courses and unlock opportunities for a brighter future. Start with Bank of Maharashtra tailored Education Loan and turn your educational dreams into reality! Interest Rate\n7.10\n%P.A *\nGet a Call Back\nEducation Loan schemes:\n1. Model Education Loan Scheme\nKnow More...\n2. Maha Bank Skill Loan Scheme\nKnow More...\n3.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c1", "doc_id": "doc_1", "text": "Maha Bank Skill Loan Scheme\nKnow More...\n3. PM - Vidya Laxmi: Education Loan Scheme\nKnow More... Features & Benefits\nDocuments Required\nInterest Rates\nEMI Calculator\nSubsidies Scheme\nFAQs\nFeatures & Benefits\nFeatures and benefits of Education Loan\nLow EMI\nHigher Loan Amount\nTrack my Loan\nSimplified Disbursement\nNo Hidden Charges\nNo Prepayment Penalty\nNo Margin Money. Up to 100% financing (for Premier institutions)\nNo collateral security (for Premier institutions). ROI concession to Girl student. Instant In-principle sanction before registration in Institutions.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c2", "doc_id": "doc_1", "text": "Instant In-principle sanction before registration in Institutions. Longer repayment period upto 15 years (Excluding Moratorium) to reduce the EMI burden. Loan will cover tuition fees, hostel fees, cost of books etc. Documents Required\nDocuments required for Education Loan\nKYC documents of Student, Applicant, Co-Applicant and Guarantor\nPhoto ID (PAN Card/Passport/Driving License/Voter ID/Aadhar Card)\nAddress Proof (Passport/Driving License/Voter ID/Aadhar Card/Ration Card/Light Bill)\nIncome documents of parents/Co-Applicants\nFor Salaried persons\nLast 2 years ITR (if Taxable Income) & Form 16\nLast 3 months salary slips\nLast 6 months salary account statements\nDocuments of Businessman / self employed\nLast 2 years ITR\nLast 2 years audited balance sheets & Profit loss statements along with computation of income\nLast 12 months business bank account statement\nTax paid challan/26AS\nBusiness Proof - Properitor - shop act / Gramapanchayath certificate\nFor Agriculturist -\nThose who do not file Income Tax Returns, income certificate issued by Tahasildar, 8A & all 7/12 extract along with supporting income proofs\nTahasildar income certificate for interest subvention claim\nOther documents related to academics\n10th std mark sheet\n12th std mark sheet\nDiploma/Degree mark sheet of all semesters\nRequisite exam scorecard /proof of obtaining seat in merit based selection process(DTE/JEE score card studies in India, GRE/TOEFL score card studying abroad or equivalent requisite exam score card)\nConfirmation letter from institute with free structure or I-20(studying abroad)\nReceipts of fees paid already\nQuotation of the laptop (fee structure of college to specially mention the requirement of course)\nIf student has taken gap during academic year affidavit for gap\nDeclaration of source of margin money if applicable. Declaration of job opportunities, expected salary after getting job. Declaration for option of repayment of interest during moratorium period.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c3", "doc_id": "doc_1", "text": "Declaration for option of repayment of interest during moratorium period. If plot/house/flat is offered as security - Latest search & valuation report & all property related documents as per housing loan checklist\nIf takeover from other bank/institution, sanction letter with statement of account . Interest Rates\nEducation Loan Interest Rates\nBank of Maharashtra helps you to provide financial assistance/support to meritorious student for pursuing higher studies with a very low EMI options. The\nEMI Calculator\non the website works this out for you. Check your eligibility, upload your documents and obtain the loan sanction. Education Loan Interest Rate\n7.10\n%P.A *\nFor more Interest Rates & Charges\nClick here\nEMI Calculator\nEducation Loan EMI Calculator\nCourse Period (Months)\n*\nLoan Amount\n*\nYear wise\nAmount Required in Year 1\nInterest Rate ( % P.A )\n*\nTenure (Months)\n*\nMoratoriam Period (Months)\n*\n0 (No Grace Period)\n1 Month\n2 Months\n3 Months\n4 Months\n5 Months\n6 Months\n7 Months\n8 Months\n9 Months\n10 Months\n11 Months\n12 Months\nWill you be paying during the study + moratorium period\nNo\nYes, full simple interest\nYes, full EMI from month 1\nTotal Moratorium:\nCalculate\nAPPLY NOW\n* (indicative,actual returns may vary)\nEducational Subsidies Scheme\nEducational Subsidies Scheme\nBank of Maharashtra provides Interest subsidies scheme for Education Loans, such as\n1) CENTRAL SECTOR INTEREST SUBSIDY SCHEME\n2) PADHO PARDESH - SCHEME OF INTEREST SUBSIDY ON EDUCATIONAL LOANS FOR OVERSEAS STUDIES FOR THE STUDENTS BELONGING TO THE MINORITY COMMUNITIES.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c4", "doc_id": "doc_1", "text": "Education Loan Interest Rate\n7.10\n%P.A *\nFor more Interest Rates & Charges\nClick here\nEMI Calculator\nEducation Loan EMI Calculator\nCourse Period (Months)\n*\nLoan Amount\n*\nYear wise\nAmount Required in Year 1\nInterest Rate ( % P.A )\n*\nTenure (Months)\n*\nMoratoriam Period (Months)\n*\n0 (No Grace Period)\n1 Month\n2 Months\n3 Months\n4 Months\n5 Months\n6 Months\n7 Months\n8 Months\n9 Months\n10 Months\n11 Months\n12 Months\nWill you be paying during the study + moratorium period\nNo\nYes, full simple interest\nYes, full EMI from month 1\nTotal Moratorium:\nCalculate\nAPPLY NOW\n* (indicative,actual returns may vary)\nEducational Subsidies Scheme\nEducational Subsidies Scheme\nBank of Maharashtra provides Interest subsidies scheme for Education Loans, such as\n1) CENTRAL SECTOR INTEREST SUBSIDY SCHEME\n2) PADHO PARDESH - SCHEME OF INTEREST SUBSIDY ON EDUCATIONAL LOANS FOR OVERSEAS STUDIES FOR THE STUDENTS BELONGING TO THE MINORITY COMMUNITIES. 3) DR. AMBEDKAR CENTRAL SECTOR SCHEME OF INTEREST SUBSIDY ON EDUCATIONAL LOANS FOR OVERSEAS STUDIES FOR OTHER BACKWARD CLASSES (OBCs) AND ECONOMICALLY BACKWARD CLASSES (EBCs)\nClick here\nto Know More about the Subsidies\nFAQs\nFrequently Asked Questions (FAQs)\nWhat is Education Loan and how does it work? Education Loan is meant to provide financial assistance/ support to meritorious student for pursuing higher studies /education in courses conducted by the Premier Educational Institutions in India such as IIMs, ISB, IITs, NITs, XLRI, MBBS, Medical College etc. Apart from these, Education Loans are also provided for Graduation courses/Colleges under Universities approved by UGC. Other courses leading to diploma / degree etc. conducted by colleges / universities approved by UGC / Govt.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c5", "doc_id": "doc_1", "text": "conducted by colleges / universities approved by UGC / Govt. / AICTE / AIBMS / ICMR etc. in India. For Studies Abroad, Education Loan is provided for Job oriented Professional/Technical / PG courses/ Post Graduation - MCA, MBA, MS etc. What are the variants of Education Loans provided by Bank of Maharashtra? Bank of Maharashtra provides three variants of Education Loans as under:\nMaha Scholar Education Loan –Loan for pursuing higher studies in Premier Institutions in India\nModel Education Loan- Loan for pursuing higher studies in India and abroad for recognized universities\nMahabank Skill Loan- Loan for Skill development courses\nMaha Scholar Overseas Education loan- Loans is granted to deserving/meritorious students for pursuing full-time regular courses in premier foreign colleges/universities\nWho can apply for Bank of Maharashtra Education Loan?", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c6", "doc_id": "doc_1", "text": "Bank of Maharashtra provides three variants of Education Loans as under:\nMaha Scholar Education Loan –Loan for pursuing higher studies in Premier Institutions in India\nModel Education Loan- Loan for pursuing higher studies in India and abroad for recognized universities\nMahabank Skill Loan- Loan for Skill development courses\nMaha Scholar Overseas Education loan- Loans is granted to deserving/meritorious students for pursuing full-time regular courses in premier foreign colleges/universities\nWho can apply for Bank of Maharashtra Education Loan? Eligible applicants include students seeking education at recognized institutions, both in India and abroad. The loan is open to Indian nationals with a secured admission offer. What are the documents required for Education Loan? You will need to furnish the following documents along with the completed application form. When the loan is jointly taken, relevant information would relate to the guardian and the student both.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c7", "doc_id": "doc_1", "text": "When the loan is jointly taken, relevant information would relate to the guardian and the student both. Mark sheet of last qualifying examination for school and graduate studies in India\nProof of admission to the course\nSchedule of expenses for the course\n2 passport size photographs\nStatement of Bank account for the last six months of borrower\nIncome tax assessment order not more than 2 years old\nBrief statement of assets and liabilities of borrower. For more details, please check\n\"Document Required\"\nsection\nIf you are not an existing bank customer you would also need to establish your identity and give proof of residence. Who can be a co-applicant in Education Loan? Co-applicant should be parent/natural guardian of the student borrower. In case of married person, co-obligator can be spouse or the parent(s)/parents in law.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c8", "doc_id": "doc_1", "text": "In case of married person, co-obligator can be spouse or the parent(s)/parents in law. Is there any requirement for collateral or a co-borrower for Bank of Maharashtra Education loans? As per Model education loan scheme devised by IBA and subsequently implemented by our bank, no collateral security is required for loansupto ₹ 7.50 lakhs and for loan above ₹ 7.50 lakhs, acceptable tangible security with sufficient margin is insisted from the borrowers. Also, under “Maha scholar education loan scheme” of our Bank for students taking admission in Premier Institutes of India, no collateral security is required for loan upto ₹ 40.00 lakhs. Are there any processing fees on Bank of Maharashtra Education Loans? There is no processing fee irrespective of loan amount for Mahabank Scholar Loans for premier Institutes.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c9", "doc_id": "doc_1", "text": "There is no processing fee irrespective of loan amount for Mahabank Scholar Loans for premier Institutes. For Mahabank Model Education Loans, there is a minimal Processing fee of 0.50% of the loan amount in case of studies abroad only& is refundable in case borrower takes up the course. What is the repayment schedule for Bank of Maharashtra Education Loans? Education loan is being extended for 15 years of tenure. The repayment would begin after one year of the course period or six months after you get a job, whichever is earlier. What expenses does the Bank of Maharashtra education loan cover?", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c10", "doc_id": "doc_1", "text": "What expenses does the Bank of Maharashtra education loan cover? Bank of Maharashtra education loan covers various expenses like tuition fees, hostel fees, cost of books, Laptop/Computer cost etc. What is the margin money required for Bank of Maharashtra Education Loans? For Maha Scholar Education Loan, there is no margin required for Premier Institutions listed under List ‘A’. For List ‘B’ & ‘C’ category Institutes, a minimal 5% margin of the loan amount is required. Under Model Education Loan uptoRs.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c11", "doc_id": "doc_1", "text": "Under Model Education Loan uptoRs. 4 lakhs, there is no margin required. Above 4 lakhs, there is a required of 5% margin for studies in India and 15% for Studies abroad. Does Bank of Maharashtra offers any special interest rates concessions for education loans? Yes, under Maha Scholar Education Loans, there is a concession of 0.10% in interest rate to Girl students. However, under Model Education Loan scheme, Bank offers interest concessions keeping the maximum concessions upto 0.50% for the following-\n0.50% concession for girl students\n0.50% concession to our existing Housing Loan borrower\nUp to 0.25% for meritorious students.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c12", "doc_id": "doc_1", "text": "However, under Model Education Loan scheme, Bank offers interest concessions keeping the maximum concessions upto 0.50% for the following-\n0.50% concession for girl students\n0.50% concession to our existing Housing Loan borrower\nUp to 0.25% for meritorious students. From where I can get the application form? To Download Form for Offline Application\nCick here\nInternet Banking\nInterest Rates\nHousing Loan\n7.35\n% P.A*\nApply Now! Car Loan\n7.70\n% P.A*\nApply Now! Gold Loan\n8.75\n% P.A*\nApply Now! Education Loan\n7.10\n% P.A*\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c13", "doc_id": "doc_1", "text": "Education Loan\n7.10\n% P.A*\nApply Now! Deposit Schemes\n7.15\n% P.A*\nKnow More\nApply Online\nHousing Loan\nApply Now! e-GST Loan\nApply Now! Car Loan\nApply Now! Gold Loan\nApply Now! Personal Loan\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c14", "doc_id": "doc_1", "text": "Personal Loan\nApply Now! Online SB Account\nOpen Now! Downloads\nCalculators\nService Charges\nPublic Information\nGallery\nSocial Activity\nAssets for Sale\nTenders\nDisclosure\nBasel II Disclosure\nBasel III Disclosure\nBRSR Disclosures\nESG Disclosures\nCompliance\nRTI\nReplies to RTI Applications\nCEPD\nCitizen Charter\nABBFF Guidelines\nPIDPI\nComplaint Handling Mechanism\nIndependent External monitors (IEMs)\nEmployee Corner\nReservation Roster\nRetired Employee’s Corner\nLife Certificate Format for Staff Pensioner\nHRMS\nFinancial Inclusion / Pradhamantri Yojana\nPMJDY\nPMJDY FAQs\nImportant Links\nIs your Bank account KYC compliant? Bank's wilful Defaulters\nAssets in possession under SARFAESI Action\nState Wise Holiday\nRBI Kehta Hai\nSachet Portal\nCalendar 2025\nVerify CheckSum value\nBlogs\nFeedback\nGet In Touch\nBank of Maharashtra Head Office\nLokmangal, 1501, Shivajinagar\nPune-411005,\n020 - 25514501 to 25514505\nImportant\nBank of Maharashtra never ask for Bank account details for any purpose through phone call/email/SMS. Bank appeals to all the customers not to respond to such phone call/email/SMS and not to share their bank account detail with any one for any purpose. Never share your CVV/ PIN No.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c15", "doc_id": "doc_1", "text": "Never share your CVV/ PIN No. of Debit/Credit card to anyone. Disclaimer\nPrivacy Policy\nCookies Policy\nSitemap\nClick here to view last visited page\nOur Services\nSCROLL TO TOP\nBank of Maharashtra, India's leading Public Sector Bank offers Deposits,Loans,Digital products for personal Banking, Corporates,MSMEs & NRI Customers\nBank of Maharashtra use cookies to enhance your experience on Bank’s website. Read More...\nBy using our website, you agree to place these cookies on your device. You can disable/delete these cookies by changing your web browser settings. Bank of Maharashtra is not responsible for cookies placed in the device of user/s by any other website and information collected thereto.", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_1_c16", "doc_id": "doc_1", "text": "Bank of Maharashtra is not responsible for cookies placed in the device of user/s by any other website and information collected thereto. Check out our\nCookie/Privacy Policy and Terms & Conditions. OK", "source_url": "https://bankofmaharashtra.bank.in/educational-loans", "fetched_at": "2025-11-12T11:55:25.345786Z"}
{"chunk_id": "doc_2_c0", "doc_id": "doc_2", "text": "﻿\nBank of Maharashtra - Personal loan at Low Interest rates\nMaha Bank Personal Loan Scheme\nMaha Bank Personal Loan Scheme\nBe it a dream vacation, celebrating special events, funding the higher studies or covering unexpected expenses like medical bills, availing personal loan is the convenient financial solution for individuals seeking immediate funds to meet their diverse needs. Mahabank Personal Loan scheme cater to the requirements of meeting personal expenses. We understand your need and ensure quick sanction of your personal loan. Forget your worries and avail Mahabank Personal Loans for all your requirements! Interest Rate\n9.00\n%P.A*\nGet a Call Back\nApply Online\nPersonal Loan Types\n1. Maha Bank Personal Loan Scheme For Salaried Customer\nKnow More...\n2.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c1", "doc_id": "doc_2", "text": "Maha Bank Personal Loan Scheme For Salaried Customer\nKnow More...\n2. Maha Bank Personal Loan Scheme For Professionals\nKnow More...\n3. Maha Bank Personal Loan Scheme For Business Class\nKnow More... Features & Benefits\nDocuments Required\nInterest Rates\nEMI Calculator\nFAQs\nHow to Apply\nFeatures & Benefits\nPersonal Loan Features and Benefits\nLow EMI\nHigher Loan Amount\nTrack my Loan\nSimplified Disbursement\nMinimal Documentation\nLowest Processing fee\nNo Hidden Charges\nNo Prepayment Penalty\nProcessing Fee 1.00 % of the loan amount + GST\nLoan amount is 20 times of Gross Monthly Income, maximum Rs 20.00 Lakhs. Minimum annual Income – 3.00 Lakhs. No Guarantor Required\nBank of Maharashtra Offers Lowest Interest Rate on Personal Loan in India\nDocuments Required\nPersonal Loan Documents Required\nProof of Identification : (any one)\nElection ID Card\nPan Card\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nProof of Residence : (any one)\nElectricity Bill\nElection ID Card\nTelephone Bill (Landline)\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nFor Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c2", "doc_id": "doc_2", "text": "No Guarantor Required\nBank of Maharashtra Offers Lowest Interest Rate on Personal Loan in India\nDocuments Required\nPersonal Loan Documents Required\nProof of Identification : (any one)\nElection ID Card\nPan Card\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nProof of Residence : (any one)\nElectricity Bill\nElection ID Card\nTelephone Bill (Landline)\nAadhar Card\nDriving License\nPhoto Identity card issued by the current Employer\nPassport\nFor Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\nFor Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc. Shop Establishment Act\nTax Registration Copy\nCompany Registration License\nBank statement for past one year\nOther documents as applicable as per scheme of loan. Interest Rates\nPersonal Loan Interest Rates\nPersonal Loan Interest Rate Starting From\n9.00\n%P.A*\nFore more Interest Rates & Charges\nClick here\nTo know more Interest Rates & Charges about other Personal Loan Schemes\nPersonal Loan scheme for Salaried customers\nClick here\nPersonal Loan scheme for Professionals\nClick here\nPersonal Loan scheme - for Business Class having Home Loan with us\nClick here\nEMI Calculator\nPersonal Loan EMI Calculator\nPrincipal Loan Amount\n*\n:\nInterest Rate ( % p.a )\n*\n:\nLoan Term (Years)\n*\n:\nSHOW EMI\nFAQs\nFrequently Asked Questions (FAQs)\nWhat is a Personal Loan? A Personal Loan is a loan that can be availed for any personal purpose such as home renovation, wedding, medical emergencies, travelling, debt repayments, bill payments and more.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c3", "doc_id": "doc_2", "text": "A Personal Loan is a loan that can be availed for any personal purpose such as home renovation, wedding, medical emergencies, travelling, debt repayments, bill payments and more. Unlike other loans, Personal Loan does not require any collateral or security and can be easily availed with minimum documentation. Like any other loan, you can repay Personal Loan with EMI (Equated Monthly Instalments); debited from your bank account. How does Personal Loan Work? To avail the Personal Loan, all you need to do is submit the loan application form. On meeting the eligibility criteria, you will get an offer with the sanctioned amount, tenure of loan and interest rate.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c4", "doc_id": "doc_2", "text": "On meeting the eligibility criteria, you will get an offer with the sanctioned amount, tenure of loan and interest rate. Once you accept the offer, funds are transferred to your bank account instantly. How can I know what my EMI amount is? You can use the\nPersonal Loan EMI Calculator\nto know your EMI amount before applying for the Loan. What can a Personal Loan be used for? Funds from Personal Loan can be used to cater to requirements of meeting personal expenses.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c5", "doc_id": "doc_2", "text": "Funds from Personal Loan can be used to cater to requirements of meeting personal expenses. How can I repay my Personal Loan? You can repay your Personal Loan via an auto-debit instruction through your Bank account on a stipulated date every month to repay your EMI. Maha Bank Personal Loan scheme for Salaried customers\nFor Category A\na) Salary Account with Bank of Maharashtra - 84 months\nb) Salary Account with Other Bank - 60 months\nFor Category B & C\n60 months\nMaha Bank Personal Loan scheme for Professionals\n60 months\nBank Personal Loan scheme - for Business Class having Home Loan with us\n84 months\nCan I apply for Personal Loan through any App? Yes, You can apply for Personal loan through Bank of Maharashtra's \"MahaMobile APP\". Download the MahaMobile app from following links:\nAndroid:\nDownload Android App\nIOS:\nDownload IOS App\nHow to Apply\nPersonal Loan How to Apply\nScan this Code\nto Apply Personal Loan Online\nFollow the step by step instructions to avail digital loan facility from our bank.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c6", "doc_id": "doc_2", "text": "Download the MahaMobile app from following links:\nAndroid:\nDownload Android App\nIOS:\nDownload IOS App\nHow to Apply\nPersonal Loan How to Apply\nScan this Code\nto Apply Personal Loan Online\nFollow the step by step instructions to avail digital loan facility from our bank. Please click on the following link to view\nhow to apply for Digital Loan Online:\nHow to Apply for Digital Loans Online\nSimilar Products\nPersonal Loan scheme for Salaried customers\nMahabank Personal Loan scheme is to cater to the requirements of meeting personal expenses. KNOW MORE\nPersonal Loan scheme for Professionals\nPersonal expenses - medical, pilgrimage domestic needs, etc. KNOW MORE\nPersonal Loan scheme - for Business Class having Home Loan with us\nTo cater to the requirements of meeting personal expenses\nKNOW MORE\nPersonal Loan for BPCL Employees\nTo meet their day to day needs\nKNOW MORE\nInternet Banking\nInterest Rates\nHousing Loan\n7.35\n% P.A*\nApply Now! Car Loan\n7.70\n% P.A*\nApply Now! Gold Loan\n8.75\n% P.A*\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c7", "doc_id": "doc_2", "text": "Gold Loan\n8.75\n% P.A*\nApply Now! Education Loan\n7.10\n% P.A*\nApply Now! Deposit Schemes\n7.15\n% P.A*\nKnow More\nApply Online\nHousing Loan\nApply Now! e-GST Loan\nApply Now! Car Loan\nApply Now! Gold Loan\nApply Now!", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c8", "doc_id": "doc_2", "text": "Gold Loan\nApply Now! Personal Loan\nApply Now! Online SB Account\nOpen Now! Downloads\nCalculators\nService Charges\nPublic Information\nGallery\nSocial Activity\nAssets for Sale\nTenders\nDisclosure\nBasel II Disclosure\nBasel III Disclosure\nBRSR Disclosures\nESG Disclosures\nCompliance\nRTI\nReplies to RTI Applications\nCEPD\nCitizen Charter\nABBFF Guidelines\nPIDPI\nComplaint Handling Mechanism\nIndependent External monitors (IEMs)\nEmployee Corner\nReservation Roster\nRetired Employee’s Corner\nLife Certificate Format for Staff Pensioner\nHRMS\nFinancial Inclusion / Pradhamantri Yojana\nPMJDY\nPMJDY FAQs\nImportant Links\nIs your Bank account KYC compliant? Bank's wilful Defaulters\nAssets in possession under SARFAESI Action\nState Wise Holiday\nRBI Kehta Hai\nSachet Portal\nCalendar 2025\nVerify CheckSum value\nBlogs\nFeedback\nGet In Touch\nBank of Maharashtra Head Office\nLokmangal, 1501, Shivajinagar\nPune-411005,\n020 - 25514501 to 25514505\nImportant\nBank of Maharashtra never ask for Bank account details for any purpose through phone call/email/SMS. Bank appeals to all the customers not to respond to such phone call/email/SMS and not to share their bank account detail with any one for any purpose.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c9", "doc_id": "doc_2", "text": "Bank appeals to all the customers not to respond to such phone call/email/SMS and not to share their bank account detail with any one for any purpose. Never share your CVV/ PIN No. of Debit/Credit card to anyone. Disclaimer\nPrivacy Policy\nCookies Policy\nSitemap\nClick here to view last visited page\nOur Services\nSCROLL TO TOP\nBank of Maharashtra, India's leading Public Sector Bank offers Deposits,Loans,Digital products for personal Banking, Corporates,MSMEs & NRI Customers\nBank of Maharashtra use cookies to enhance your experience on Bank’s website. Read More...\nBy using our website, you agree to place these cookies on your device. You can disable/delete these cookies by changing your web browser settings.", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
{"chunk_id": "doc_2_c10", "doc_id": "doc_2", "text": "You can disable/delete these cookies by changing your web browser settings. Bank of Maharashtra is not responsible for cookies placed in the device of user/s by any other website and information collected thereto. Check out our\nCookie/Privacy Policy and Terms & Conditions. OK", "source_url": "https://bankofmaharashtra.bank.in/personal-banking/loans/personal-loan", "fetched_at": "2025-11-12T11:55:32.392654Z"}
